yaroslau1/Firmware_LastRelease/_7.0.95/MainMCU/_stm32_it.h
/**
  ******************************************************************************
  * @file    Project/Template/stm32f10x_it.h
  * @author  MCD Application Team
  * @version  V3.0.0
  * @date    04/06/2009
  * @brief   This file contains the headers of the interrupt handlers.
  ******************************************************************************
  * @copy
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2009 STMicroelectronics</center></h2>
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32_IT_H
#define __STM32_IT_H

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx.h"

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
/* Exported functions ------------------------------------------------------- */

#ifdef __cplusplus
 extern "C" {
#endif

void NMI_Handler(void);
void HardFault_Handler(void);
void MemManage_Handler(void);
void BusFault_Handler(void);
void UsageFault_Handler(void);
void SVC_Handler(void);
void DebugMon_Handler(void);
void PendSV_Handler(void);
void SysTick_Handler(void);
//void RTC_IRQHandler(void);
void USART1_IRQHandler(void);
//void USART2_IRQHandler(void);
//void TIM1_CC_IRQHandler(void);
void DMA2_Stream0_IRQHandler(void);
//void DMA1_Channel2_IRQHandler(void);
//void DMA1_Channel3_IRQHandler(void);
//void DMA2_Channel1_IRQHandler(void);
//void DMA1_Channel1_IRQHandler(void);
//void TIM5_IRQHandler(void);
#ifdef SD_SPI_MODE
void TIM3_IRQHandler( void );
#endif /* SD_SPI_MODE */
//void TIM7_IRQHandler( void );
//void TIM4_IRQHandler( void );
//void RTCAlarm_IRQHandler(void);
void EXTI0_IRQHandler(void);
void EXTI1_IRQHandler(void);
void EXTI2_IRQHandler(void);
//void EXTI4_IRQHandler(void);
//void EXTI3_IRQHandler(void);
void EXTI9_5_IRQHandler(void);
//void EXTI15_10_IRQHandler(void);
//void USART1_IRQHandler(void);
void USART3_IRQHandler(void);
#ifdef SD_SDIO_MODE
void SDIO_IRQHandler(void);
#endif /* SD_SDIO_MODE */
//void ADC1_2_IRQHandler( void );
void ADC3_IRQHandler( void );

extern void xPortPendSVHandler( void );
extern void xPortSysTickHandler( void );
extern void vPortSVCHandler( void );

#ifdef __cplusplus
}
#endif

#endif /* __STM32_IT_H */

/******************* (C) COPYRIGHT 2009 STMicroelectronics *****END OF FILE****/
